package com.keduits;

public class Exam01_Arrays {
	
	
//	정적 필드 Character[] 래퍼런스 타입인 참조형 변수
	public static Character[] stringlist = 
		{'K', 'o','r','e','a','n'};
//	list 변수는 그 객체들을 가리키는 참조 갖고 있다.

//	래퍼런스(Reference)"란 객체를 가리키거나 참조하는 것을 말함. 
//	자바에서는 모든 객체가 힙 메모리에 생성 
//	이 객체들을 다루기 위해서는 객체를 가리키는 참조(주소)가 필요함. 
//	이러한 참조를 래퍼런스라고 한다.
	
//	래퍼런스는 객체가 실제로 위치한 메모리 주소를 가리키며, 
//	이를 통해 해당 객체에 접근하고 조작이 가능함 
//	자바에서 객체는 new 키워드를 사용하여 생성되고, 이렇게 생성된 객체는 힙(heap) 영역에 저장됨 
//	이후에 객체를 사용하려면 해당 객체를 가리키는 래퍼런스가 필요함
	
}