package ArrayTest;

public class Stons_flatos {

	public static void main(String[] args) {
		
//		두 돌의 무게를 
//		승현이는 N개의 돌을 주워서 무게가 증가하는 순서대로 놓는다. 
//		두 돌의 무게가 같은 경우는 없다. 
//		가장 가벼운 돌에게는 1순위, 두 번째로 가벼운 돌에게는 2순위, ..., 가장 무거운 돌에게는 N순위가 주어진다.
//		승현이에게는 양팔 저울이 있어서 모든 돌을 양팔 저울 위에 임의의 순서대로 놓기. 
//		승현이가 어떤 순서대로 저울의 어떤 접시에 돌을 놓을 것인지는 알려져 있습니다.
//		여러분은 승현이가 돌을 얹을 때마다 저울이 어느 쪽으로 기우는지 알아내는 프로그램을 작성
//		승현이는 각 돌의 정확한 무게를 알려주지 않습니다.
		
//		첫 번째 줄에 돌의 수 N (1≤N≤100, 000)이 주어진다.
//		다음 N개 줄에는 두 개의 정수 R(1≤R≤N)과 S(1≤S≤2)이 주어집니다. 
//		R은 저울에 얹을 돌의 순위이고 S는 돌을 얹을 저울의 접시 번호이고 모든 R은 서로 다릅니다.

	}

}
